ci/app/Controllers/Home.php

    public function records()
	{
        $data['students'] = $this->studentmodel->findAll();
---
SELECT *
FROM `students`

    public function edit()
	{
		$id = $this->request->uri->getSegment(3);
		$data['student'] = $this->studentmodel->where('id', $id)->first();
---
SELECT *
FROM `students`
WHERE `id` = '15'
 LIMIT 1

	public function delete()
	{
		$id = $this->request->uri->getSegment(3);
		$this->studentmodel->where('id', $id)->delete();
---
DELETE FROM `students`
WHERE `id` = '27'