ci4_simplified/app/Controllers/Home.php

    public function records()
	{
        $data['students'] = $this->studentmodel->findAll();
---
SELECT *
FROM `students`

	public function store()
	{
        $data = [
            'first_name' => $this->request->getPost('Fname'),
            'last_name' => $this->request->getPost('Lname'),
            'address' => $this->request->getPost('Address'),
            'email' => $this->request->getPost('Email'),
            'mobile' => $this->request->getPost('Mobile'),
        ];
		$this->studentmodel->insert($data);
---
INSERT INTO `students` (`first_name`, `last_name`, `address`, `email`, `mobile`) VALUES ('test', 'test', 'test', 'test', 'test')

    public function edit()
	{
		$id = $this->request->uri->getSegment(3);
		$data['student'] = $this->studentmodel->where('id', $id)->first();
---
SELECT *
FROM `students`
WHERE `id` = '17'
 LIMIT 1

	public function update()
	{
        $data = [
			'first_name' => $this->request->getPost('Fname'),
            'last_name' => $this->request->getPost('Lname'),
            'address' => $this->request->getPost('Address'),
            'email' => $this->request->getPost('Email'),
            'mobile' => $this->request->getPost('Mobile'),
		];
		$id = $this->request->uri->getSegment(3);
		$this->studentmodel->update($id, $data);
---
UPDATE `students` SET `first_name` = 'Anne', `last_name` = 'Heaps', `address` = '56 Student street', `email` = 'aother@uclan.ac.uk', `mobile` = '0987654321'
WHERE `students`.`id` IN ('17')

	public function delete()
	{
		$id = $this->request->uri->getSegment(3);
		$this->studentmodel->where('id', $id)->delete();
---
DELETE FROM `students`
WHERE `id` = 'delete'